# Migración de datos de MySql a SQL Server

### Primero hay que hacer las conexiones a las bases de datos

In [33]:
import pandas as pd
from sqlalchemy import create_engine
import pyodbc

mySqlConn = None
tSqlConn = None

def connectToDatabases():
    global mySqlConn, tSqlConn
    try:
        
        # Conectarse a MySQL
        mySqlConn = create_engine("mysql+mysqlconnector://root:123456@localhost/pay_assistant_db")

        # Conectarse a SQL Server con pyodbc
        tSqlConn = pyodbc.connect(
            'DRIVER={ODBC Driver 17 for SQL Server};'
            'SERVER=localhost;'
            'DATABASE=solturaDB;'
            'Trusted_Connection=yes;'
        )

        
        print("Éxito al conectarse!")


        # Conectarse a SQL Server
        # TODO
    
    except Exception as e:
        print (f"Error: {e}")

In [35]:
connectToDatabases()

Éxito al conectarse!

### Una vez hechas las conexiones, se va a extraer todos los datos de mysql a migrar

In [38]:
# Instanciar las variables globales de las tablas con los datos a migrar
df_users = None
df_currencies = None
df_subscriptions = None
df_planPrices = None
df_planFeaturesSubscriptions = None
df_schedules = None
df_scheduleDetails = None
df_userPlanPrices = None
df_countries = None
df_states = None
df_cities = None
df_addresses = None
df_userAddresses = None

In [40]:
# Esta función hace todos los queries de las tablas y los guarda en DataFrames
def extractAllData():
    global df_users, df_currencies, df_subscriptions, df_planPrices, df_planFeaturesSubscriptions, df_schedules, df_scheduleDetails, df_userPlanPrices, df_countries
    global df_cities, df_states, df_addresses, df_userAddresses
    df_users = pd.read_sql("SELECT * FROM pay_users;",mySqlConn)
    df_currencies = pd.read_sql("SELECT * FROM pay_currencies;",mySqlConn)
    df_subscriptions = pd.read_sql("SELECT * FROM pay_subscriptions;",mySqlConn)
    df_planPrices = pd.read_sql("SELECT * FROM pay_plan_prices;",mySqlConn)
    df_planFeaturesSubscriptions = pd.read_sql("SELECT * FROM pay_plan_features_subscriptions;",mySqlConn)
    df_schedules = pd.read_sql("SELECT * FROM pay_schedules;",mySqlConn)
    df_scheduleDetails = pd.read_sql("SELECT * FROM pay_schedules_details;",mySqlConn)
    df_userPlanPrices = pd.read_sql("SELECT * FROM pay_users_plan_prices;",mySqlConn)
    df_countries = pd.read_sql("SELECT * FROM pay_countries;",mySqlConn)
    df_states = pd.read_sql("SELECT * FROM pay_states;",mySqlConn)
    df_cities = pd.read_sql("SELECT * FROM pay_city;",mySqlConn)
    df_addresses = pd.read_sql("SELECT * FROM pay_addresses;",mySqlConn)
    df_userAddresses = pd.read_sql("SELECT * FROM pay_users_adresses;",mySqlConn)

In [132]:
# Ahora se llama la función para meter todos los datos en los dataFrame
extractAllData()

### En esta parte se pueden ver los valores de las tablas al extraerse del MySql

In [126]:
df_users

,user_id,email,first_name,last_name,password,enabled
0,1,PaulaPonce1@gmail.com,Paula,Ponce,b'2bf5309e56428a57f073efd97e7668a08cfc74db0a44...,1
1,2,EmmaRamos2@gmail.com,Emma,Ramos,b'48e217aeaa990fa02a72367bda2ab6aeb77e87c9b4f4...,1
2,3,RicardoSalazar3@gmail.com,Ricardo,Salazar,b'228b4b3c75ace3216c8189a12cca88befb322d9696c2...,1
3,4,AnaGarcía4@gmail.com,Ana,García,b'0c44f0413a7351ae8a456633b6512797ea4cb515fa29...,1
4,5,MartaMejía5@gmail.com,Marta,Mejía,b'43fa4a3e9cdd525128edaa7b7b7fd330f41d3aeb44c2...,1
...,...,...,...,...,...,...
1045,1046,CamilaAcosta1046@gmail.com,Camila,Acosta,b'13a33a2c53304fffac7614be31a4bfe851f8a6d9f439...,1
1046,1047,LorenaRamírez1047@gmail.com,Lorena,Ramírez,b'850b066ee061196ac4ed3b237979a7197fa506228af5...,1
1047,1048,FranciscoEstrada1048@gmail.com,Francisco,Estrada,b'288d77e654df324e0d688d227f806c74034c3254792d...,1
1048,1049,JavierGuerrero1049@gmail.com,Javier,Guerrero,b'bd469a97a827aec59ef3593118fb364a0af0db1558f6...,1
1049,1050,ElenaFigueroa1050@gmail.com,Elena,Figueroa,b'21a6cffef3fce12cf6ed2a3ff79ade9ff80b4678fe77...,1

In [47]:
df_currencies

   currency_id                  name acronym symbol  country_id
0            1   Colón Costarricense     CRC      ₡           1
1            2  Dólar Estadounidense     USD      $           2

In [62]:
df_subscriptions

   subscription_id description
0                1    Estándar
1                2     Premium

In [64]:
df_planPrices

,plan_prices_id,subscrition_Id,amount,currency_id,postTime,endDate,current
0,1,1,9.99,2,2025-04-30 06:06:52,2025-12-31,1
1,2,2,39.99,2,2025-04-30 06:06:52,2025-12-31,1

In [66]:
df_planFeaturesSubscriptions

   plan_features_id  subscription_id value  enabled
0                 1                1    No        1
1                 1                2    Sí        1
2                 2                1    50        1
3                 2                2   200        1
4                 3                1     5        1

In [27]:
df_schedules

,schedule_id,name,repit,repetitions,recurrencyType,endDate,startDate
0,1,Pago Estándar Mensual,1,12,1,None,2025-04-30 06:06:52
1,2,Pago Premium Anual,0,1,2,None,2025-04-30 06:06:52

In [70]:
df_scheduleDetails

,schedules_details_id,deleted,schedule_id,baseDate,datePart,last_execute,next_execute,description,detail
0,1,0,1,2025-04-30 06:06:52,2025-01-01,None,2025-02-01,Pago mensual,Pago mensual de la suscripción Estándar
1,2,0,2,2025-04-30 06:06:52,2025-01-01,None,2026-01-01,Pago anual,Pago anual de la suscripción Premium

In [72]:
df_userPlanPrices

,user_plan_price_id,user_id,plan_prices_id,adquision,enabled,schedule_id
0,1,1,1,2025-03-28,1,1
1,2,2,1,2025-03-19,1,1
2,3,3,1,2025-04-16,1,1
3,4,4,1,2025-03-16,1,1
4,5,5,1,2025-02-08,1,1
...,...,...,...,...,...,...
1045,1046,1046,2,2025-03-12,1,2
1046,1047,1047,2,2025-04-25,1,2
1047,1048,1048,2,2025-02-12,1,2
1048,1049,1049,2,2025-02-16,1,2
1049,1050,1050,2,2025-03-25,1,2

In [74]:
df_countries

   country_id            name
0           1      Costa Rica
1           2  Estados Unidos
2           3          España
3           4          México
4           5       Argentina
5           6           Chile
6           7        Colombia
7           8            Perú
8           9          Brasil
9          10         Francia

In [76]:
df_states

   state_id          name  country_id
0         1       Cartago           1
1         2      Alajuela           1
2         3       Florida           2
3         4         Texas           2
4         5  Buenos Aires           5
5         6       Córdoba           5
6         7        Madrid           3
7         8     Barcelona           3
8         9     São Paulo           9
9        10          Lima           8

In [78]:
df_cities

   city_id  state_id              name
0        1         1           Parrita
1        2         2         Santa Ana
2        3         3             Miami
3        4         4            Austin
4        5         5     Mar del Plata
5        6         6  Villa Carlos Paz
6        7         7           Sevilla
7        8         8            Sitges
8        9         9          Campinas
9       10        10          Arequipa

In [65]:
df_addresses

,address_id,line1,line2,zipcode,geoposition,city_id
0,1,Calle 1 #41,None,47290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xf0\x9e...,4
1,2,Calle 2 #54,None,52776,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xae\xb1...,3
2,3,Calle 3 #85,None,55158,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x7f\xbf...,9
3,4,Calle 4 #60,None,33987,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00h\x7f\n/...,3
4,5,Calle 5 #21,None,27804,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00l\xf9\x1...,9
...,...,...,...,...,...,...
1045,1046,Calle 1046 #32,None,99560,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x00\xf1...,1
1046,1047,Calle 1047 #25,None,11560,"b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x04,\xb...",10
1047,1048,Calle 1048 #67,None,58368,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xd4\x86...,7
1048,1049,Calle 1049 #14,None,85524,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xf0\xe9...,9
1049,1050,Calle 1050 #1,None,66755,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x93\x12...,4

In [82]:
df_userAddresses

     user_address_id  user_id  address_id  enabled
0                  1        1           1        1
1                  2        2           2        1
2                  3        3           3        1
3                  4        4           4        1
4                  5        5           5        1
..               ...      ...         ...      ...
995              996      996         996        1
996              997      997         997        1
997              998      998         998        1
998              999      999         999        1
999             1000     1000        1000        1

[1000 rows x 4 columns]

Las funciones de migración son responsables de:

- Hacer los inserts respectivos y adaptar los datos de las tablas al diseño de soltura

- Actualizar los id's respectivos de los datos, hay algunas tablas que requieren los id's como los de los usuarios para relacionar los datos en la base de datos de soltura

In [49]:
# Cursor para ejecutar los queries e inserts de SQL Server
cursor = tSqlConn.cursor()

In [134]:
# Migrar los usuarios y conseguir los IDs del TSQL

# Crear una tabla para tener los viejos userIDs y los nuevos para sustituirlos luego en las otras tablas 
userIDMap = pd.DataFrame(columns = ["oldUserID","newUserID"])

# Insertar uno por uno cada usuario
for index, row in df_users.iterrows():
    try:
        oldUserID = row["user_id"]

        # Insertar con OUTPUT para recuperar el userID generado
        cursor.execute("""
            INSERT INTO solturaDB.sol_users(email, firstName, lastName, password)
            OUTPUT INSERTED.userID
            VALUES (?, ?, ?, ?);
        """, (row["email"], row["first_name"], row["last_name"], row["password"]))
        
        # Recuperar el nuevo userID desde la salida del query
        newUserID = cursor.fetchone()[0]

        # Guarda el nuevo y viejo userID
        userIDMap.loc[len(userIDMap)] = [oldUserID, newUserID]
        # Cambia el userID para saber el nuevo userID del usuario en SQL Server
        df_users.at[index, "user_id"] = newUserID

        # Insertar al usuario nuevo a una tabla auxiliar que indique que es usuario del app assistant y no ha cambiado su contraseña
        cursor.execute("""
            INSERT INTO dbo.sol_migratedUsers(userID, platform, changedPassword)
            VALUES (?, ?, ?);
        """, (newUserID, "Payment Assistant", 0))

    except Exception as e:
        print(f"Error migrando usuario {oldUserID}: {e}")
# Hacer el commit de todo al final                   
tSqlConn.commit()

In [135]:
# Crear un diccionario de los IDs para remplazar los user_id en tablas que lo ocupan como FK
idMap = dict(zip(userIDMap["oldUserID"], userIDMap["newUserID"]))

df_userAddresses["user_id"] = df_userAddresses["user_id"].map(idMap)
df_userPlanPrices["user_id"] = df_userPlanPrices["user_id"].map(idMap)

In [138]:
# Ver los nuevos userIDs de la tabla de usuarios
df_users

,user_id,email,first_name,last_name,password,enabled
0,3,PaulaPonce1@gmail.com,Paula,Ponce,b'2bf5309e56428a57f073efd97e7668a08cfc74db0a44...,1
1,4,EmmaRamos2@gmail.com,Emma,Ramos,b'48e217aeaa990fa02a72367bda2ab6aeb77e87c9b4f4...,1
2,5,RicardoSalazar3@gmail.com,Ricardo,Salazar,b'228b4b3c75ace3216c8189a12cca88befb322d9696c2...,1
3,6,AnaGarcía4@gmail.com,Ana,García,b'0c44f0413a7351ae8a456633b6512797ea4cb515fa29...,1
4,7,MartaMejía5@gmail.com,Marta,Mejía,b'43fa4a3e9cdd525128edaa7b7b7fd330f41d3aeb44c2...,1
...,...,...,...,...,...,...
1045,1048,CamilaAcosta1046@gmail.com,Camila,Acosta,b'13a33a2c53304fffac7614be31a4bfe851f8a6d9f439...,1
1046,1049,LorenaRamírez1047@gmail.com,Lorena,Ramírez,b'850b066ee061196ac4ed3b237979a7197fa506228af5...,1
1047,1050,FranciscoEstrada1048@gmail.com,Francisco,Estrada,b'288d77e654df324e0d688d227f806c74034c3254792d...,1
1048,1051,JavierGuerrero1049@gmail.com,Javier,Guerrero,b'bd469a97a827aec59ef3593118fb364a0af0db1558f6...,1
1049,1052,ElenaFigueroa1050@gmail.com,Elena,Figueroa,b'21a6cffef3fce12cf6ed2a3ff79ade9ff80b4678fe77...,1

In [140]:
# Ver la tabla de userIDs nuevos y viejos
userIDMap

      oldUserID  newUserID
0             1          3
1             2          4
2             3          5
3             4          6
4             5          7
...         ...        ...
1045       1046       1048
1046       1047       1049
1047       1048       1050
1048       1049       1051
1049       1050       1052

[1050 rows x 2 columns]

In [142]:
# Ver las tablas actualizadas de df_userAddresses y df_userPlanPrices
df_userAddresses

     user_address_id  user_id  address_id  enabled
0                  1        3           1        1
1                  2        4           2        1
2                  3        5           3        1
3                  4        6           4        1
4                  5        7           5        1
..               ...      ...         ...      ...
995              996      998         996        1
996              997      999         997        1
997              998     1000         998        1
998              999     1001         999        1
999             1000     1002        1000        1

[1000 rows x 4 columns]

In [144]:
df_userPlanPrices

,user_plan_price_id,user_id,plan_prices_id,adquision,enabled,schedule_id
0,1,3,1,2025-03-28,1,1
1,2,4,1,2025-03-19,1,1
2,3,5,1,2025-04-16,1,1
3,4,6,1,2025-03-16,1,1
4,5,7,1,2025-02-08,1,1
...,...,...,...,...,...,...
1045,1046,1048,2,2025-03-12,1,2
1046,1047,1049,2,2025-04-25,1,2
1047,1048,1050,2,2025-02-12,1,2
1048,1049,1051,2,2025-02-16,1,2
1049,1050,1052,2,2025-03-25,1,2